function checkEmptItemNum(charaindex)
	EmptyItemNum = 0
	for i = 9, 23 do
		if char.getItemIndex(charaindex, i) == -1 then
			EmptyItemNum = EmptyItemNum + 1
		end
	end
	return EmptyItemNum
end

function checkEmptPetNum(charaindex)
	EmptyPetNum = 0
	for i = 0, 4 do
		if char.check(char.getCharPet(charaindex, i)) == 0 then
			EmptyPetNum = EmptyPetNum + 1
		end
	end
	return EmptyPetNum
end

function otherljcard(itemindex, charaindex, toindex, haveitemindex)
	local itemtype = 0
	itemtype = other.atoi(item.getChar(itemindex,"字段"))
	if itemtype < 1 or itemtype > 2 then
		return
	end
	char.DelItem(charaindex, haveitemindex)
	local rnd = math.mod(math.random(99999), 1121)
	if itemtype == 1 then
		for i = 1, table.getn(drawlist) do
			if rnd <= drawlist[i][1] then
				if drawlist[i][2] == 1 then
					if checkEmptPetNum(charaindex) == 0 then
						char.Alert(charaindex,"很抱歉，您的身上宠物已满！",4,300)
						return
					end
					local petid = drawlist[i][3][math.random(table.getn(drawlist[i][3]))]
					npc.AddPet(charaindex, petid)
					char.TalkToCli(charaindex,-1,"果断刮开这张来吉卡，得到宠物 — " .. enemytemp.getEnemyTempNameFromEnemyID(petid) , 27)
				elseif drawlist[i][2] == 2 then
					--local itemid = drawlist[i][3][math.random(table.getn(drawlist[i][3]))]
					local giveitemindex = npc.AddRandItem(charaindex, drawlist[i][3])
				--	char.TalkToCli(charaindex,-1,"刮刮刮...刮开这来吉卡【".. rnd .. "】，得到道具 — " ..  item.getChar(giveitemindex,"名称") , 27)
					char.TalkToCli(charaindex,-1,"刮刮刮...刮开这来吉卡，得到道具 — " ..  item.getChar(giveitemindex,"名称") , 27)
					for j=1,table.getn(allserveritemdata) do
						if item.getInt(giveitemindex,"序号") == allserveritemdata[j][1] then
							local itemname = ""
							if string.len(allserveritemdata[j][2]) == 0 then
								itemname = item.getNameFromNumber(allserveritemdata[j][1])
							else
								itemname = allserveritemdata[j][2]
							end
							char.talkToServer(-1,"[江湖传闻] [" .. char.getChar(charaindex,"名字") .. "] 人品爆发，从来吉卡中刮到一个 " .. itemname .. " 要不要你也来一张。", 29)
							break
						end
					end
				end
				return
			end
		end
	else
		for i = 1, table.getn(drawlist2) do
			if rnd <= drawlist2[i][1] then
				if drawlist2[i][2] == 1 then
					if checkEmptPetNum(charaindex) == 0 then
						char.Alert(charaindex,"很抱歉，您的身上宠物已满！",4,300)
						return
					end
					local petid = drawlist2[i][3][math.random(table.getn(drawlist2[i][3]))]
					npc.AddPet(charaindex, petid)
					char.TalkToCli(charaindex,-1,"果断刮开这刮开来吉卡，得到宠物 — " .. enemytemp.getEnemyTempNameFromEnemyID(petid) , "随机色")
				elseif drawlist2[i][2] == 2 then
					--local itemid = drawlist2[i][3][math.random(table.getn(drawlist2[i][3]))]
					local giveitemindex = npc.AddRandItem(charaindex, drawlist2[i][3])
					char.TalkToCli(charaindex,-1,"果断刮开这刮开来吉卡，得到道具 — " ..  item.getChar(giveitemindex,"名称") , 27)
					for j=1,table.getn(allserveritemdata) do
						if item.getInt(giveitemindex,"序号") == allserveritemdata[j][1] then
							local itemname = ""
							if string.len(allserveritemdata[j][2]) == 0 then
								itemname = item.getNameFromNumber(allserveritemdata[j][1])
							else
								itemname = allserveritemdata[j][2]
							end
							char.talkToServer(-1,"[" .. char.getChar(charaindex,"名字") .. "] 人品爆发，从来吉卡中刮到一个 " .. itemname .. " 要不要你也来一张。", 29)
							break
						end
					end
				end
				return
			end
		end
	end
end

function data()
						--机率,类型,奖品ID
						
						--- A级来吉卡 
	drawlist = {{400,   2, "14661-14840,14361-14540,16161-16340,42004,14961-15140,14067-14240,15861-16040,15261-15440,14661-14840,14361-14540,16161-16340,14961-15140"}   ---出13-18级武器
						,{151,  2, "21023-21026,21040-21043,21032-21035,21036-21039,24012,24006,42005,42004,24013,42731,42734,23720,42735,20841"}    ---圣兽碎片、金猪蛋、机猫蛋、狼人、中国龙、狼神
						,{450,  2, "25100,25100,25100,30006,42004,42005,42003"}    ---宠碎、骑碎、能量结晶、MM玩偶
						,{351,  2, "21023-21026,21040-21043,21032-21035,21036-21039,24012,24006,42005,42004,24013,42731"}    ---圣兽碎片、金猪蛋、机猫蛋、狼人、中国龙
						 ,{600,  2, "17601-17900,17101-17400,17401,16641,16461-16640,16791-16940,17801-17900,17101-17400,16461-16640,16791-16940"}   ---出13-18级装备
						 ,{608,  2, "22033,22000,25102,25112,25122,30006,22021,22022,22023,22024"}    ---稀有高价值道具 机暴、年兽蛋、2级守护、加格水
						 ,{660,  2, "18076-18078,18079-18090,18091-18093,18094-18105"}  ---出环9-10   666
						 ,{680,  2, "18061-18063,18064-18075"}    ---出环8   692
						 ,{692,  2, "30005,30006,42005,42004"}    ---机豹改属性、宠碎、证碎
						 ,{990,  2, "32104,32106,32110,32112,42004,32204,32206,32210,32212,32304,32306,32310,32312"}    --3天人物皮肤  （兰甲赛亚人、金鱼小豆丁、绿斑小豆丁、紫暴小豆丁）
						 ,{997,  2, "32204,32206,32210,32212,42004"}       --7天人物皮肤（兰甲赛亚人、金鱼小豆丁、绿斑小豆丁、紫暴小豆丁）
						 ,{1000, 2, "32304,32306,32310,32312"}     --15天人物皮肤（兰甲赛亚人、金鱼小豆丁、绿斑小豆丁、紫暴小豆丁）
						 ,{1025, 2, "25101,25111,25121"}    ---出1级光环
						 ,{1120, 2, "22050,22050,22050,22050,22051,22051,22050,22050"}				-- 祝福
						 --,{1000, 2, "32304,32306,32310,32312"}     --15天人物皮肤（兰甲赛亚人、金鱼小豆丁、绿斑小豆丁、紫暴小豆丁）
						 --,{1001, 2, "24007,42005,24012,24006,24008,24008,24019,24020,24017,23712,21030,42704,42705"}    ---出梦宠
						 --,{1025,  2, "25101,25111,25121"}    ---出1级光环
						 --,{1120,  2, "22050,22050,22050,22050,22051,22051,22050,22050,42701,42702,42703"}				-- 祝福
						 }
						--- S级来吉卡 
	drawlist2 = {{20,   2, "14781-14900,14481-14600,16281-16400,15081-15200,14181-14300,15981-16100,15381-15500,14781-14900,14481-14600,16281-16400,15081-15200"}   ---出18-20级武器
						 ,{35,  2, "17801-18000,17301-17450,17451,16581-16670,16881-17000,16671,16677,16683,16689,16695,17801-17900,17301-17450,17451,16581-16670,16881-17000"}   ---出17-19级装备
						 ,{45,  2, "18076-18078,18079-18090,18091-18093,18094-18105,23712"}    ---出环9-10
						 ,{55,  2, "18061-18063,18064-18075,25100,42004,24020"}    ---出环8
						 ,{59,  2, "25100,25101,25111,25121,25131,22033,42005,24020"}    ---出1级光环
						 ,{88,  2, "22005,22003,21021,21009,21008,21011,21010,19014,19695,23014,23015,23016,20713,20714,20715,20716,22026,22000,20900,20833,21029,22042-22047,22042-22045"}    ---出杂货
						 ,{95,  2, "21023-21026,21040-21043,21032-21035,21036-21039,23712"}    ---出牌子
						 ,{97,  2, "24003,24003,42005,23712"}    --神级物品3
						 ,{99,  2, "24041,24041,42005,42004"}       --神级物品1
						 ,{100, 2, "24034,24034,24034,24034,25100,25100,25100,25100,25101,25111,25121,25131"}       --神级物品2
						 ,{110,  2, "22050,22050,22050,22050,22050,22051,23802,23802,23803,23804"}				-- 祝福
						 }
						 
	allserveritemdata = {{22021,""},{22022,""},{22023,""},{22024,""},{22033,""},{22000,""},{24001,""},{24002,""},{24003,""},{24004,""},{32104,""},{32106,""},{32110,""},{32116,""},{32204,""},{32206,""},{32210,""},{32216,""},{32304,""},{32306,""},{32310,""},{32316,""},{22005,""},{21021,""},{21009,""},{21008,""},{21011,""},{21010,""},{19014,""},{19695,""},{22026,""},{20833,""},{22046,""},{22047,""},{30005,""},
	
	{17109,"合成铠13(滋润的精灵 Lv5)"},{17119,"合成铠13[地](滋润的精灵 Lv5)"},{17129,"合成铠13[水](滋润的精灵 Lv5)"},{17139,"合成铠13[火](滋润的精灵 Lv5)"},{17149,"合成铠13[风](滋润的精灵 Lv5)"},
	{17159,"合成铠14(滋润的精灵 Lv5)"},{17169,"合成铠14[地](滋润的精灵 Lv5)"},{17179,"合成铠14[水](滋润的精灵 Lv5)"},{17189,"合成铠14[火](滋润的精灵 Lv5)"},{17199,"合成铠14[风](滋润的精灵 Lv5)"},
	{17209,"合成铠15(滋润的精灵 Lv5)"},{17219,"合成铠15[地](滋润的精灵 Lv5)"},{17229,"合成铠15[水](滋润的精灵 Lv5)"},{17239,"合成铠15[火](滋润的精灵 Lv5)"},{17249,"合成铠15[风](滋润的精灵 Lv5)"},
	{17259,"合成铠16(滋润的精灵 Lv5)"},{17269,"合成铠16[地](滋润的精灵 Lv5)"},{17279,"合成铠16[水](滋润的精灵 Lv5)"},{17289,"合成铠16[火](滋润的精灵 Lv5)"},{17299,"合成铠16[风](滋润的精灵 Lv5)"},
	{17309,"合成铠17(滋润的精灵 Lv5)"},{17319,"合成铠17[地](滋润的精灵 Lv5)"},{17329,"合成铠17[水](滋润的精灵 Lv5)"},{17339,"合成铠17[火](滋润的精灵 Lv5)"},{17349,"合成铠17[风](滋润的精灵 Lv5)"},
	{17359,"合成铠18(滋润的精灵 Lv5)"},{17369,"合成铠18[地](滋润的精灵 Lv5)"},{17379,"合成铠18[水](滋润的精灵 Lv5)"},{17389,"合成铠18[火](滋润的精灵 Lv5)"},{17399,"合成铠18[风](滋润的精灵 Lv5)"},
	{17409,"合成铠19(滋润的精灵 Lv5)"},{17419,"合成铠19[地](滋润的精灵 Lv5)"},{17429,"合成铠19[水](滋润的精灵 Lv5)"},{17439,"合成铠19[火](滋润的精灵 Lv5)"},{17449,"合成铠19[风](滋润的精灵 Lv5)"},
	{17459,"合成铠20(滋润的精灵 Lv5)"},{17469,"合成铠20[地](滋润的精灵 Lv5)"},{17479,"合成铠20[水](滋润的精灵 Lv5)"},{17489,"合成铠20[火](滋润的精灵 Lv5)"},{17499,"合成铠20[风](滋润的精灵 Lv5)"},

	{17609,"合成服13(滋润的精灵 Lv5)"},{17619,"合成服13[地](滋润的精灵 Lv5)"},{17629,"合成服13[水](滋润的精灵 Lv5)"},{17639,"合成服13[火](滋润的精灵 Lv5)"},{17649,"合成服13[风](滋润的精灵 Lv5)"},
	{17659,"合成服14(滋润的精灵 Lv5)"},{17669,"合成服14[地](滋润的精灵 Lv5)"},{17679,"合成服14[水](滋润的精灵 Lv5)"},{17689,"合成服14[火](滋润的精灵 Lv5)"},{17699,"合成服14[风](滋润的精灵 Lv5)"},
	{17709,"合成服15(滋润的精灵 Lv5)"},{17719,"合成服15[地](滋润的精灵 Lv5)"},{17729,"合成服15[水](滋润的精灵 Lv5)"},{17739,"合成服15[火](滋润的精灵 Lv5)"},{17749,"合成服15[风](滋润的精灵 Lv5)"},
	{17759,"合成服16(滋润的精灵 Lv5)"},{17769,"合成服16[地](滋润的精灵 Lv5)"},{17779,"合成服16[水](滋润的精灵 Lv5)"},{17789,"合成服16[火](滋润的精灵 Lv5)"},{17799,"合成服16[风](滋润的精灵 Lv5)"},
	{17809,"合成服17(滋润的精灵 Lv5)"},{17819,"合成服17[地](滋润的精灵 Lv5)"},{17829,"合成服17[水](滋润的精灵 Lv5)"},{17839,"合成服17[火](滋润的精灵 Lv5)"},{17849,"合成服17[风](滋润的精灵 Lv5)"},
	{17859,"合成服18(滋润的精灵 Lv5)"},{17869,"合成服18[地](滋润的精灵 Lv5)"},{17879,"合成服18[水](滋润的精灵 Lv5)"},{17889,"合成服18[火](滋润的精灵 Lv5)"},{17899,"合成服18[风](滋润的精灵 Lv5)"},
	{17909,"合成服19(滋润的精灵 Lv5)"},{17919,"合成服19[地](滋润的精灵 Lv5)"},{17929,"合成服19[水](滋润的精灵 Lv5)"},{17939,"合成服19[火](滋润的精灵 Lv5)"},{17949,"合成服19[风](滋润的精灵 Lv5)"},
	{17959,"合成服20(滋润的精灵 Lv5)"},{17969,"合成服20[地](滋润的精灵 Lv5)"},{17979,"合成服20[水](滋润的精灵 Lv5)"},{17989,"合成服20[火](滋润的精灵 Lv5)"},{17999,"合成服20[风](滋润的精灵 Lv5)"},
	
	{18061,""},{18062,""},{18063,""},{18064,""},{18065,""},{18066,""},{18067,""},{18068,""},{18069,""},{18070,""},{18071,""},{18072,""},{18073,""},{18074,""},{18075,""},
	{18076,""},{18077,""},{18078,""},{18079,""},{18080,""},{18081,""},{18082,""},{18083,""},{18084,""},{18085,""},{18086,""},{18087,""},{18088,""},{18089,""},{18090,""},
	{18091,""},{18092,""},{18093,""},{18094,""},{18095,""},{18096,""},{18097,""},{18098,""},{18099,""},{18100,""},{18101,""},{18102,""},{18103,""},{18105,""},{18104,""},
	{24006,""},{24007,""},{24008,""},{24009,""},{24010,""},{42005,""},
	{25101,""},{25102,""},{25103,""},{25104,""},{25105,""},{25100,""},
	{25111,""},{25112,""},{25113,""},{25114,""},{25115,""},{42004,""},
	{25121,""},{25122,""},{25123,""},{25124,""},{25125,""},{23702,""},{42731,""},{42734,""},{42735,""},{24013,""},
{24013,""},{24014,""},{24015,""},{24016,""},

	{21031,""},{23803,""},{23014,""},{23015,""},{23804,""},{22050,""},{25024,""},{22051,""},{22052,""},{22053,""},{21032,""},{21033,""},{21034,""},{21035,""},{21036,""},{21037,""},{21038,""},{21039,""},{21108,""},{22020,""},{22021,""},{22022,""},{22023,""},{21500,""},{21040,""},{21041,""},{21042,""},{21043,""},{21112,""},{21113,""},{21113,""},{21114,""},{21115,""},{21116,""},{21023,""},{21024,""},{21025,""},{21026,""},{24041,""},{24034,""},{22000,""},{17451,"合成铠20"},{16671,"合成兜20"},{16677,"合成兜20[地]"},{16683,"合成兜20[水]"},{16689,"合成兜20[火]"},{16695,"合成兜20[风]"},{16672,"合成兜20净毒"},{16673,"合成兜20净石化"},{16674,"合成兜20净混乱"},{16675,"合成兜20净酒醉"},{16676,"合成兜20净昏睡"},{16678,"合成兜20[地]净毒"},{16679,"合成兜20[地]净石化"},{16680,"合成兜20[地]净混乱"},{16681,"合成兜20[地]净酒醉"},{16682,"合成兜20净[地]昏睡"},{16684,"合成兜20[水]净毒"},{16685,"合成兜20[水]净石化"},{16686,"合成兜20[水]净混乱"},{16687,"合成兜20[水]净酒醉"},{16688,"合成兜20[水]净昏睡"},{16690,"合成兜20[火]净毒"},{16691,"合成兜20[火]净石化"},{16692,"合成兜20[火]净混乱"},{16693,"合成兜20[火]净酒醉"},{16694,"合成兜20[火]净昏睡"},{16696,"合成兜20[水]净毒"},{16697,"合成兜20[水]净石化"},{16698,"合成兜20[水]净混乱"},{16699,"合成兜20[水]净酒醉"},{16700,"合成兜20[水]净昏睡"}}
end

function main()
	data()
	item.addLUAListFunction( "ITEM_OTHERLJCARD", "otherljcard", "")
end
