function ShowMsg(meindex, charaindex, page)
	local text = {"\n    1、宠物回收价格，根据游戏进度会不断调整\n    不另行通知 \n\n    2、回收种类亦可能会增加或者删除\n    详情请以官网为准。恕不另行通知，请知悉。",
	"\n    3，开放限时宠物和现在的市场回收员功能\n    都是为了消耗市场富余的物品从而一定程度\n    的调控市场。",
	"\n    4，梦宠类---圣兽类---魔兽类 均回收为金币\n    普通商宠2D回收均为水晶\n\n    5，宠物赎回后均为1级状态，赎回功能暂未开放\n    玩家自愿行为\n    回收或赎回后均不可更改找回或取消，切记"}
	local button = 40
	if page == #text then
		button = 24
	elseif page > 1 and page < #text then
		button = 56
	end
	local token = text[page]
	lssproto.windows(charaindex, 0, button, page+10, char.getWorkInt(meindex, "对象"), token)
end

function Talked(meindex, talkerindex, szMes, color )	
	if npc.isFaceToFace(meindex, talkerindex) == 1 then
		local token = char.getChar(meindex, "名字") .. "|宠物回收系统\n多余的宠物可找我典当回收\n当然我会给你相当的报酬|3|〖赎回典当宠物〗|〖回收多余宠物〗|〖宠物典当说明〗"
		lssproto.windows(talkerindex, "新选择框", 8, 0, char.getWorkInt( meindex, "对象"), token)
	end
end

function WindowTalked (meindex, talkerindex, seqno, select, data)
	if npc.isFaceToFace(meindex, talkerindex) == 1 and select ~= 8 then
		if seqno == 0 then
			if data*1 == 1 then
				lssproto.windows(talkerindex, 0, 1, -1, char.getWorkInt( meindex, "对象"), "\n\n\n              赎回系统近期开启")
			elseif data*1 == 2 then
				lssproto.windows(talkerindex, 3, 8, 1, char.getWorkInt( meindex, "对象"), 1);
			elseif data*1 == 3 then
				ShowMsg(meindex, talkerindex,1)
			end
		elseif seqno == 1 then
			local petindex = char.getCharPet(talkerindex,data-1)
			local payment,bill,centtype = petcheck(talkerindex,petindex)
			if payment > 0 then
				local token = "                 [style c=5]〖"..char.getChar(petindex,"名字").."〗[/style]\n\n"
				.."              回收价为：[style c=4]"..payment.."[/style]"..centtype
				.."\n              赎回价为：[style c=2]"..bill.."[/style]"..centtype
				.."\n\n           [style c=21]注意:[/style][style c=20]赎回后宠物将还原未转1级[/style]"
				.."\n              [style c=6]确定后宠物将会回收[/style]"
				lssproto.windows(talkerindex, 0, 12, 2, char.getWorkInt( meindex, "对象"), token)
				char.setWorkInt(talkerindex, "NPC临时1", petindex)
				char.setWorkInt(talkerindex, "NPC临时2", bill)
				char.setWorkInt(talkerindex, "NPC临时3", payment)
				char.setWorkChar(talkerindex, "NPC临时4", centtype)
			end
		elseif seqno == 2 then
			local petindex,paytype = char.getWorkInt(talkerindex, "NPC临时1"),0
			if char.check(petindex) == 1 then
				if char.getInt(petindex,"守护兽") ~= 3 then
					if char.getWorkChar(talkerindex, "NPC临时4") == "金币" then
						sasql.setVipPoint(talkerindex, sasql.getVipPoint(talkerindex)+char.getWorkInt(talkerindex, "NPC临时3"))
						paytype = 1
					else
						sasql.setPetPoint(talkerindex, sasql.getPetPoint(talkerindex)+char.getWorkInt(talkerindex, "NPC临时3"))
					end
					sasql.query("insert into Petrecycle values ('"..char.getChar(talkerindex, "账号")
					.."',"..char.getInt(petindex,"宠ID")..","..char.getWorkInt(talkerindex, "NPC临时2")..","..paytype..",NOW())")
					local token = "\n\n\n                  [style c=6]回收成功[/style]\n\n"
					.."              获得[style c=4]"..char.getWorkInt(talkerindex, "NPC临时3").."[/style]"..char.getWorkChar(talkerindex, "NPC临时4")
					lssproto.windows(talkerindex, 0, 1, -1, char.getWorkInt( meindex, "对象"), token)
					char.talkToAllServer("P|P|[宠物回收]玩家"..char.getChar(talkerindex, "名字").."在宠物典当员回收了精品宠物"..char.getChar(petindex,"名字").."，如有需要的玩家可前往赎回此宠物","")
					char.DelPet(talkerindex,petindex)
				else
					char.newMessageToCli(talkerindex,-1,"家族守护兽无法进行回收",4)
				end
			end
		elseif seqno > 10 then
			if select == 32 then
				ShowMsg(meindex, talkerindex, seqno-9)
			elseif select == 16 then
				ShowMsg(meindex, talkerindex, seqno-11)
			end
		end
	end
end

function petcheck(talkerindex,petindex)
	local qualified,num,point = false,0,char.getWorkInt(petindex,"最大HP")/4 + char.getWorkInt(petindex,"攻击力") + char.getWorkInt(petindex,"防御力") + char.getWorkInt(petindex,"敏捷力")
	for i=1,#petlist do
		if char.getInt(petindex,"宠ID") == petlist[i][1] then
			qualified,num = true,petlist[i][2][#petlist[i][2]]
			for j=1,#petlist[i][2] do
				if point >= petlist[i][2][j] then
					return petlist[i][3][j],petlist[i][4][j],"金币"
				end
			end
		end
	end
	for i=1,#petlist2 do
		if char.getInt(petindex,"宠ID") == petlist2[i][1] then
			qualified,num = true,petlist2[i][2][#petlist2[i][2]]
			for j=1,#petlist2[i][2] do
				if point >= petlist2[i][2][j] then
					return petlist2[i][3][j],petlist2[i][4][j],"水晶"
				end
			end
		end
	end
	if qualified then
		char.newMessageToCli(talkerindex,-1,char.getChar(petindex,"名字").."的评分必须大于等于："..num, 4)
	else
		char.newMessageToCli(talkerindex,-1,"您选择的宠物无法回收", 4)
	end
	return 0
end

function Create(name, metamo, floor, x, y, dir)
	local npcindex = npc.CreateNpc(name, metamo, floor, x, y, dir);
	char.setFunctionPointer(npcindex, "对话事件", "Talked", "")
	char.setFunctionPointer(npcindex, "窗口事件", "WindowTalked", "")
end

function data()
	 --enemybaseID,评分,金币,赎回价格
	petlist = {{777,{1465,1400},{108000,88000},{132000,187000}}--佩露夏
			  ,{3034,{1465,1400},{108000,88000},{132000,187000}}--凯恩
			  ,{3033,{1460,1400},{98000,88000},{122000,178000}}--美拉
			  ,{3000,{1460,1400},{98000,88000},{122000,178000}}--菲奇亚
			  ,{986,{1455,1400},{98000,80000},{122000,178000}}--火魔兽
			  ,{985,{1455,1400},{98000,80000},{122000,178000}}--地魔兽
			  ,{1047,{1455,1400},{98000,80000},{222000,178000}}--水魔兽
			  ,{1048,{1455,1400},{98000,80000},{222000,178000}}--风魔兽
			  ,{3052,{1455,1400},{78880,60000},{160000,138000}}--邦司凉朵
			  ,{3057,{1450,1400},{78880,60000},{155000,130000}}--阿米朵
			  ,{3038,{1450,1400},{78880,60000},{155000,130000}}--朵巴奈特
			  ,{3037,{1455,1400},{78880,60000},{160000,140000}}--斑尼迪克
			  ,{3063,{1450,1400},{68000,56000},{148000,110800}}--美尔卡顿
			  ,{3058,{1455,1400},{78880,60000},{155000,130000}}--帖克洛斯
			  ,{3035,{1450,1400},{78000,56000},{150000,110800}}--帖鲁齐尔格
			  ,{3040,{1460,1400},{78000,56000},{150000,110800}}--艾迪希洛
			  ,{3020,{1430,1380},{68000,40000},{90000,60800}}--里拉拉
			  ,{4559,{1420,1380},{60000,40000},{100000,70800}}--机械年兽
			  ,{4560,{1430,1380},{60000,40000},{100000,70800}}--
			  ,{4561,{1430,1380},{60000,40000},{100000,70800}}--
			  ,{4562,{1430,1380},{60000,40000},{100000,70800}}--
			  ,{3053,{1390,1360},{78000,60000},{160000,118000}}--地人狼
			  ,{3054,{1390,1360},{78000,60000},{160000,118000}}--
			  ,{3055,{1390,1360},{78000,60000},{160000,118000}}--
			  ,{3056,{1400,1360},{78000,60000},{160000,118000}}--
			  ,{3068,{1400,1360},{78000,60000},{180000,158000}}--幽灵
			  ,{3069,{1400,1360},{78000,60000},{180000,158000}}
	}
	--enemybaseID,评分,水晶,赎回价格
	petlist2 = {{725,{1420,1385},{26500,13500},{30800,17800}}--扑满乌力
			   ,{3018,{1310,1280},{16500,10500},{18800,12800}}--兔拉尔
			   ,{3019,{1330,1280},{16500,10500},{18800,12800}}--兔拉拉
			   ,{3021,{1330,1280},{16500,10500},{18800,12800}}--兔达达
			   ,{3026,{1350,1320},{25500,15500},{28800,17800}}--天使乌宝依
			   ,{3028,{1350,1320},{25500,15500},{28800,17800}}--天使乌拉拉
			   ,{3029,{1390,1340},{29000,20500},{41800,33800}}--地狗年
			   ,{3030,{1380,1340},{29000,20500},{41800,33800}}--水狗年
			   ,{3031,{1380,1340},{29500,20500},{41800,33800}}--火狗年
			   ,{3032,{1380,1340},{29500,20500},{41800,33800}}--风狗年
			   ,{3041,{1390,1340},{26500,20500},{40800,31800}}--史奈克特
			   ,{3042,{1390,1340},{26500,20500},{40800,31800}}--葛利斯奈
			   ,{3043,{1390,1340},{26500,20500},{40800,31800}}--艾柏瑞
			   ,{3044,{1390,1340},{26500,20500},{40800,31800}}--拉特利
			   ,{3126,{1370,1340},{12500,9500},{18000,12800}}--迪基格斯
			   ,{754,{1360,1320},{10500,6500},{12800,8800}}--邦诺斯娜
			   ,{35,{1380,1340},{39500,28500},{41800,32800}}--史卡皮诺
			   ,{36,{1380,1340},{39500,28500},{41800,32800}}--史卡皮克
			   ,{37,{1380,1340},{39500,28500},{41800,32800}}--史卡皮奥
			   ,{38,{1380,1340},{39500,28500},{41800,32800}}--史卡皮顿
			   ,{3046,{1390,1340},{38500,30500},{52800,33800}}--萨德迪比
			   ,{3047,{1390,1340},{38500,30500},{52800,33800}}--萨德斯凯
			   ,{3006,{1360,1330},{24500,20500},{38800,27800}}--2D贝鲁卡
			   ,{3007,{1360,1330},{24500,20500},{38800,27800}}--2D贝鲁伊卡
			   ,{3008,{1360,1330},{24500,20500},{38800,27800}}--2D格鲁西斯
			   ,{3009,{1360,1330},{24500,20500},{38800,27800}}--2D金格萨贝鲁
			   ,{3001,{1375,1330},{24500,20500},{37800,26800}}--2D利则诺顿
			   ,{3002,{1380,1330},{24500,20500},{37800,26800}}--2D扬奇洛斯
			   ,{3003,{1390,1330},{24500,20500},{37800,26800}}--2D邦浦洛斯
			   ,{3004,{1380,1330},{24500,20500},{37800,26800}}--2D邦奇诺
			   ,{3005,{1380,1330},{24500,24500},{37800,26800}}--2D布鲁顿
			   ,{3010,{1350,1310},{12500,8500},{20800,12800}}--蓝龟
			   ,{117,{1380,1340},{29500,23500},{41800,31800}}--地狮子
			   ,{118,{1380,1340},{29500,23500},{41800,31800}}--狮子
			   ,{119,{1380,1340},{29500,23500},{41800,31800}}--狮子
			   ,{120,{1380,1340},{29500,23500},{41800,31800}}--狮子
			   ,{969,{1365,1325},{28500,22500},{40800,32800}}--猴赛雷
			   ,{765,{1320,1285},{10500,6500},{11800,7800}}--司尔顿
			   ,{766,{1320,1285},{10500,6500},{11800,7800}}--格尔希洛
			   ,{767,{1320,1285},{10500,6500},{11800,7800}}--梅尔顿
			   ,{768,{1320,1285},{10500,6500},{11800,7800}}--戈登尔顿
			   ,{901,{1400,1360},{18500,10500},{20800,11800}}--地年兽
			   ,{902,{1400,1360},{18500,10500},{20800,11800}}--年兽
			   ,{903,{1400,1360},{18500,10500},{20800,11800}}--年兽
			   ,{904,{1400,1360},{18500,10500},{20800,11800}}--年兽
			   ,{908,{1410,1350},{13500,8500},{15800,10800}}--小水怪
			   ,{957,{1380,1340},{23500,13500},{25800,15800}}--端午
			   ,{958,{1380,1340},{23500,13500},{25800,15800}}--端午
			   ,{959,{1380,1340},{23500,13500},{25800,15800}}--端午
			   ,{960,{1380,1340},{23500,13500},{25800,15800}}--端午
			   ,{784,{1380,1340},{11500,7500},{12800,9800}}--2D鲨鱼
			   ,{785,{1380,1340},{11500,7500},{12800,9800}}--2D鲨鱼
			   ,{786,{1380,1340},{11500,7500},{12800,9800}}--2D鲨鱼
			   ,{787,{1380,1340},{11500,7500},{12800,9800}}--2D鲨鱼
			    ,{91,{1290,1275},{500,200},{2800,800}}--绿人龙
			   ,{92,{1330,1300},{500,200},{2800,800}}--人龙
			   ,{93,{1320,1290},{500,200},{2800,800}}--人龙
			   ,{94,{1300,1275},{500,200},{2800,800}}--人龙
			   ,{95,{1310,1290},{500,200},{2800,800}}--人龙
			   ,{755,{1340,1310},{500,200},{2800,800}}--黑人龙
			   ,{291,{1285,1265},{500,200},{2800,800}}--鸡
			   ,{292,{1285,1265},{500,200},{2800,800}}--
			   ,{293,{1285,1265},{500,200},{2800,800}}--
			   ,{294,{1275,1255},{500,200},{2800,800}}--鲨鱼
			   ,{221,{1270,1255},{500,200},{2800,800}}--
			   ,{222,{1270,1255},{500,200},{2800,800}}--
			   ,{223,{1270,1255},{500,200},{2800,800}}--
			   ,{141,{1300,1275},{500,200},{2800,800}}--猩猩
			   ,{142,{1300,1275},{500,200},{2800,800}}--
			   ,{144,{1300,1275},{500,200},{2800,800}}--
			   ,{232,{1320,1295},{500,200},{2800,800}}--毒蛙
			   ,{233,{1320,1295},{500,200},{2800,800}}--
			   ,{234,{1320,1295},{500,200},{2800,800}}--
			   ,{791,{1350,1325},{500,200},{2800,800}}--
			   ,{61,{1300,1275},{500,200},{2800,800}}--拳王
			   ,{63,{1300,1275},{500,200},{2800,800}}--
			   ,{64,{1300,1275},{500,200},{2800,800}}--
			   ,{65,{1300,1275},{500,200},{2800,800}}--
			   ,{41,{1265,1245},{500,200},{2800,800}}--舌头
			   ,{42,{1300,1280},{500,200},{2800,800}}--舌头
			   ,{44,{1300,1280},{500,200},{2800,800}}--舌头
			   ,{301,{1320,1280},{500,200},{2800,800}}--暴龙
			   ,{302,{1300,1270},{500,200},{2800,800}}--暴龙
			   ,{303,{1300,1270},{500,200},{2800,800}}--暴龙
			   ,{304,{1295,1270},{500,200},{2800,800}}--暴龙
			   ,{71,{1265,1245},{500,200},{2800,800}}--跳狗
			   ,{191,{1260,1245},{500,200},{2800,800}}--老虎
			   ,{192,{1260,1245},{500,200},{2800,800}}--老虎
			   ,{193,{1260,1245},{500,200},{2800,800}}--老虎
			   ,{194,{1260,1245},{500,200},{2800,800}}--老虎
			   ,{252,{1280,1265},{500,200},{2800,800}}--雷龙
			   ,{253,{1300,1280},{500,200},{2800,800}}--雷龙
			   ,{254,{1300,1280},{500,200},{2800,800}}--雷龙
			   ,{255,{1290,1275},{500,200},{2800,800}}--雷龙
			   ,{4547,{1320,1265},{12500,7000},{7800,2800}}--机械雷
			   ,{4540,{1290,1255},{12500,7000},{7800,2800}}--机械虎
			   
	}
	
end

function main()
	data()
	Create("宠物回收员", 16336, 2006, 23, 20, 4)
end