function ShowHead (talkerindex)
	local questionnum = other.CallFunction("queryHuoyueType", "data/ablua/npc/huoyue/huoyue.lua", {talkerindex,5})
	if questionnum >= 10 then
		char.newMessageToCli(talkerindex, -1, "今日已完成全部答题", "白色")
		return 0
	end
	local questionid = math.random(#questionlist)
	token = 10 .. "|" .. questionnum + 1 .. "|" .. questionid .. "|" .. questionlist[questionid][1] .. "|" .. questionlist[questionid][2] .. "|" .. questionlist[questionid][3] .. "|" .. questionlist[questionid][4] .. "|" .. questionlist[questionid][5]
	lssproto.windows(talkerindex, 1012, 8, 0, char.getWorkInt( npcindex, "对象"), token)
	return 0
end
--NPC窗口事件(NPC索引)
function WindowTalked ( meindex, talkerindex, seqno, select, data)
	if select == 2 or select == 8 then
		return
	end
	if seqno == 0 then
		if data == "" then
			return
		end
		local type = other.getString(data,"|",1)
		if type == "S" then
			local questionid = other.getString(data,"|",2)
			if questionid == "" then
				return
			end
			questionid = other.atoi(questionid)
			if questionid < 1 or questionid > #questionlist then
				return
			end
			local questionan = other.getString(data,"|",3)
			if questionan == "" then
				return
			end
			questionan = other.atoi(questionan)
			if questionan < 1 or questionan > 4 then
				return
			end
			local questionnum = other.CallFunction("queryHuoyueType", "data/ablua/npc/huoyue/huoyue.lua", {talkerindex,5})
			if questionnum >= 10 then
				char.newMessageToCli(talkerindex, -1, "今日已完成全部答题", "白色")
				return
			end
			if questionan == questionlist[questionid][6] then
				char.setInt(talkerindex,"活力",char.getInt(talkerindex,"活力") + 3)
				char.newMessageToCli(talkerindex, -1, "答题正确，获得3活力", "白色")
			else
				char.newMessageToCli(talkerindex, -1, "答题错误，请再接再厉", "白色")
			end
			other.CallFunction("updateHuoyue", "data/ablua/npc/huoyue/huoyue.lua", {talkerindex,5,1})
			questionnum = questionnum + 1
			if questionnum < 10 then
				questionid = math.random(#questionlist)
				token = 10 .. "|" .. questionnum + 1 .. "|" .. questionid .. "|" .. questionlist[questionid][1] .. "|" .. questionlist[questionid][2] .. "|" .. questionlist[questionid][3] .. "|" .. questionlist[questionid][4] .. "|" .. questionlist[questionid][5]
				lssproto.windowsupdate(talkerindex, 1012, 8, 0, char.getWorkInt( meindex, "对象"), token)
			else
				if char.getInt(talkerindex,"等级") >= 10 then
					other.CallFunction("NewPlayerFlg","data/ablua/newplayer.lua",{talkerindex,607,0})
				end
			end
		end
	end
end

function Create(name, metamo, floor, x, y, dir)
	--创建NPC(NPC名字，图像号，地图号，坐标X，坐标Y，方向号)将返回一个NPC索引
	npcindex = npc.CreateNpc(name, metamo, floor, x, y, dir)
	--设置事件触发(NPC索引，事件，执行函数，执行函数文件路径)

	char.setFunctionPointer(npcindex, "窗口事件", "WindowTalked", "")
end

function data()
	questionlist = {{"注册帐号需要填写哪几个信息？","帐号.密码","帐号.密码.家庭住址","帐号.密码.手机号码","帐号.密码.QQ邮箱",3}
					,{"帐号.密码.二级密码更改怎么找回。","通过帐号找回","通过密码找回","通过手机号找回","通过QQ找回",3}
					,{"1级的新手怎样骑老虎？","直接抓一只老虎骑","抓一只老虎并把忠诚加满","购买高等级老虎骑","大喝一声",2} 
					,{"新手装可以用到几转几级？","1转1级","2转120级","4转130级","5转140级",4}
					,{"以下哪件装备免气？","恩泽之枪.新手的铠甲","月光的手镯.龙之枪","精灵王弓.合成护身符","合成爪.合成枪",1}             
					,{"如何方便快捷去其他各个村庄？","使用村庄羽毛或者便捷传送","坐长毛象客运","手动跑过去","什么都不用做",1}
					,{"多少级可以做成人仪式任务","1级","10级","29级","30级",4}
					,{"碎片怎么获取？","跑环任务奖励","等级礼包奖励","商城购买","通过阎罗殿几率获取",4}         
					,{"下列方法中哪个不能获取声望？","积分换取.跑环奖励","在线时间自动获取","乱舞PK声望礼包.阎罗殿","人物与宠物升级.做任务",2}
					,{"以下哪种方法不能获得经验？","站在村庄里","遇敌打怪","离线挂机","使用经验丹",1}
					,{"属性相克哪个是对的？","地-水-火-风","火-地-水-风","风-火-水-地","地-风-水-火",1}
					,{"以下哪些是四大村庄？","玛丽娜斯渔村.卡鲁他那村.萨姆吉尔村.加加村","多多村.乌鲁力村.奇努伊村.加加村","福尔德村.奇喀喀村.塔母塔母村.卡坦村","柯尔克村.达那村.霍特尔村.柯奥村",1}
					,{"家族成员最多可以加入多少成员？","30个成员","50个成员","90个成员","100个成员",4}             
					,{"在哪里可以摆摊？","四大村庄","萨伊纳斯","四大庄园","漆黑洞窟",1}
					,{"摆摊收取多少手续费？","5%手续费","15%手续费","50%手续费","10%手续费",4}
					,{"洗宠物需要什么道具？","回炉宝珠","命运之戒","火属性宝珠","金币",1}  
					,{"以下哪件装备在野外和洞窟不遇敌？","恩泽之枪","真视之镜","月亮手环","精灵王弓",3}
					,{"乱舞PK赛去渔村医院找哪个NPC报名？","族战观战师","段位管理员","乱舞PK赛雕像","战点服务员",3}
					,{"抓宠比赛在渔村医院找哪个NPC报名参加？","活动管理员","格斗鉴定师","捕鱼达人","段位管理员",1}
					,{"合成比赛在渔村医院找哪个NPC报名参加？","活动管理员","格斗鉴定师","捕鱼达人","段位管理员",1}
					,{"抓宠比赛可以获取什么奖励？","石币","水晶","声望","宠物",3}
					,{"合成比赛可以获取什么奖励？","金币","声望","装备","活力",2} 
					,{"跑环任务在加加村哪个NPC接取？","加加村长","巫女","跑环接待","村姑",3}   
					,{"跑环任务可以接取多少次？","3次","5次","10次","没有限制",3}
					,{"哪只宠物善于料理？","乌力","布克布克","佩露夏","贝洛恩",1}  
					,{"哪只宠物善于合成？","金格萨贝鲁","乌力斯坦","修宝","达克尔",3}
					,{"高等净化精灵的作用是什么？","解除我方异常状态","无效果","反弹对方攻击","单体属性反转",1}      
					,{"调和精灵的作用是什么？","单体属性反转","全体属性反转","全体变成无属性","属性增强",3}    
					,{"奥罗拉的精灵作用是什么？","反弹对方伤害","无效果","全体属性反转","吸收对方攻击",3}  
					,{"彩虹的精灵作用是什么？","全体变成无属性","反弹对方伤害","吸收对方攻击伤害","单体属性反转",4}
					,{"光的精灵作用是什么？","吸收对方攻击伤害并回复气血","反弹对方伤害","属性增强","单体属性反转",1}     
					,{"守护的精灵作用是什么？","吸收对方攻击伤害","反弹对方攻击伤害","阻挡对方两次伤害","无效果",3} 
					,{"镜子的精灵作用是什么？","属性增强","全体属性反转","反弹对方攻击伤害","解除我方异常状态",3}  
					,{"人物升级点数对攻击影响最大的是什么？","体力","耐力","敏捷","腕力",4}  
					,{"下列哪件武器基础伤害高？","爪","弓箭","斧头","枪",3}  
					,{"达到什么条件就可以进行人物转生？","80级+成人仪式","80级+成人+4大洞窟","100级+4大洞窟","120级+成人+4大洞窟",2}
					,{"阎罗殿NPC从哪里进入？","加加村","村长家","渔村医院","萨村雕像旁",3}              
					,{"以下物品哪个不是刷楼获取的？","声望.改点水","碎片.装备","石币.经验果","活力.宠物",4}                
					,{"四大庄园成功守庄7天可以获取什么？","高等级装备","碎片","马年蛋蛋","人物皮肤",3}          
					,{"四大庄园成功守庄15天可以获取什么？","高等级装备","机暴骑证（永久）","马年蛋蛋","人物皮肤",4}
					,{"四大庄园成功守庄30天可以获取什么？","高等级装备","大量活力","机暴骑证（永久）","大量声望",3}    
					,{"50年前的波拉岛怎么去？","便捷传送","跑过去","羽毛飞过去","渔村记录点传送",1}       
					,{"如何获取战点？","挂机升级","在线时长","免费领取","族战PK",4}           
					,{"5转活力在线最高获得是多少？","75","200","150","125",2}                   
					,{"1-30级前该去哪练级？","吉鲁岛打大象","漆黑洞窟打雷龙","阿布的洞窟打乌龟","50年前波拉岛",3}         
					,{"30-50级该去哪练级？","北吉鲁岛打大象","漆黑洞窟打雷龙","海底通路打海主人","50年前波拉岛",3}           
					,{"50-80级该去哪里练级？","北吉鲁岛打大象","漆黑洞窟打雷龙","海底通路打海主人","地下1楼打穿山甲",4}           
					,{"80-120级该去哪里练级？","北吉鲁岛打大象","高级练级场","海底通路打海主人","50年前波拉岛",4}           
					,{"120-140级该去哪里练级？","北吉鲁岛打大象","高级练级场","海底通路打海主人","50年前波拉岛",2}           
					,{"不可思议的贝壳通过什么任务获取？","梦德洞窟任务","送贝壳任务","五兄弟任务","龙洞任务",2}       
					,{"修宝宠物通过什么任务获取？","梦幻洞窟任务","四宝玉任务","马祖任务","卡坦任务",4}      
					,{"商城里的永久恩枪多少金币？","6000","3000","5000","4000",1}           
					,{"1级MM礼盒哪里购买？","游戏商城","宠物店","24小时店","武器店",1}             
					,{"怎么快速获取石币？","娱乐捕鱼场","乱舞PK","龙域副本","十殿阎罗",1}           
					,{"日常声望如何获取？","每日在线3小时","每日获取200活力","每日完成日常","每日参加乱舞PK",3}     
					,{"挂一只成品MM需要多少活力？","300","720","460","800",2}        
					,{"阎罗殿获取的装备可以兑换什么？","活力","石币","声望","战点",1}           
					,{"小猪赛跑第一名可以获取多少活力？","10","50","20","30",3}                               
					,{"欢乐派派送在哪里可以点击参加？","任务指引页面","游戏福利页面","游戏商城页面","游戏系统页面",2}           
					,{"携带宠物练级每个等级阶段可以获取什么？","石币奖励","水晶奖励","声望奖励","战点奖励",3}           
					,{"玩家在线时长可以获取什么？","活力","声望","石币","战点",1}                      
					,{"段位排位赛多少级可以参加？","1转130级","5转140级","3转140级","2转110级",2}           
					,{"激情捕鱼活动可以获取什么？","石币","声望","金币","宠物",3}           
					,{"精灵等级最高是多少级的？","LV2","LV3","LV4","LV5",4}           
					,{"挑战阎罗殿需要什么？","地狱通行证","声望","金币","水晶",1}            
					,{"猩猩系宠物如何获取？","探秘宝箱","宠物捕捉","宠物碎片换取","每日签到",2}                           
					,{"飞龙系宠物如何获取？","转生任务.宠物捕捉","商城购买","宠物碎片换取","探秘宝箱",1}             
					,{"宠物祝福师在哪里？","萨姆吉尔村","渔村医院内","卡坦村","加加村",2}                   
					,{"合成铠可以用下列什么材料合成？","石+皮","木+牙","木+线 ","壳+土",1}            
					,{"合成枪可以用下列什么材料合成？","土+线","牙+花","木+牙"," 骨+牙",3}                  
					,{"合成爪可以用下列什么材料合成？","花+牙","壳+牙","土+木","骨+牙",2}               
					,{"克克尔属于什么系？","威威系","特殊系","克克尔系","人龙系",3}                 
					,{"帖拉所伊朵属于什么系？","毒蛙系","暴龙系","猩猩系","拳王系",2}                 
					,{"以下哪种影响转生点数红利？","离线挂机","在线挂机","PK比赛","人物等级.做任务",4}                
					,{"人物腕力增加什么？","人物攻击和少量血","人物敏捷","人物防御和少量血","人物血量",1}           
					,{"人物体力增加什么？","人物攻击和少量血","人物敏捷","人物防御和少量血","人物血量和少量防御",4}           
					,{"人物耐力增加什么？","人物攻击和少量血","人物敏捷和少量攻击","人物防御和少量血","人物血量",3}            
					,{"人物速度增加什么？","人物攻击和少量血","人物敏捷和少量攻击及血量","人物防御和少量血","人物血量和防御",2}
					,{"宠物上榜需要什么条件？","宠物战斗力","宠物成长","宠物四维","宠物等级",1}             
					,{"每日在线多久可以领取每日奖励？","10分钟","半小时","50分钟","一个小时",4}             
					,{"每月可以签到多少天？","15天","30天","28天","31天",3}           
					,{"骑红蓝暴龙需要什么？","商城购买骑证","直接骑乘","做骑乘任务","加入4大家族",4}             
					,{"象券需要多少金币购买？","10000金币","30000金币","20000金币","35000金币",1}}
					
	vigordata = 5
	leveldata = {5,10,15,20,25,30,35,40,45,50,55,60,65,70,75,80,82,84,86,88,90,92,94,96,98,100,102,104,106,108,110,112,114,116,118,120,122,124,126,128,130,132,134,136,138,140}
end

function main()
	data()
	Create("玩家答题", 16014, 777, 35, 35, 4)
end
