function EquipEffectFunction( charaindex, id )
	return 1
end

function data()
					 	--庄园， --武器类型
	fmpoint = {{1041, 4, 50} --萨村庄园,弓
						,{2031, 17, 50} --渔村庄园,回旋标
						,{3031, 18, 50} --加加庄园,投掷斧头
						,{4031, 19, 50} --卡村庄园,投掷石
						}
						
								
	equipagelist = {{{20898, 20899, 20900}, {20901}, {20902}, 110003}
									,{{20903, 20904, 20905}, {20906}, {20907}, 110004}
									,{{20908, 20909, 20910}, {20911}, {20912}, 110005}
									,{{20913, 20914, 20915}, {20916}, {20917}, 110006}
									}
	opt = {0}
end

function main()
	data()
end
