function warppoint(talkerindex,warplistindex)
	--if char.getWorkInt(talkerindex,"组队") ~= 0 then
		--char.newMessageToCli(talkerindex,-1,"组队状态下无法传送","白色")
		--return 0
	--end
	--print("[chuansong:warppoint]cur map",char.getInt(talkerindex,"地图号"))
	if char.getInt(talkerindex,"地图号") == 117 then
		char.newMessageToCli(talkerindex,-1,"当前地图不支持传送功能.","白色")
		return 0
	end
	for i=1,#warpdata do
		if warplistindex == warpdata[i][1] then
			--print("[chuansong:warppoint]",warpdata[i][5],warpdata[i][6],warpdata[i][7])
			if warpdata[i][5] ~= nil and warpdata[i][5] ~= "" then
				if config.getGameservername() ~= warpdata[i][5] then
					char.newMessageToCli(talkerindex,-1,"请到" .. warpdata[i][5] .. "参加","白色")
					return 0
				end
			end
			if warpdata[i][6] > -1 then
				if char.getInt(talkerindex,"转数") < warpdata[i][6] then
					char.newMessageToCli(talkerindex,-1,"您的转数不足" .. warpdata[i][6] .. "转,无法传送","白色")
					return 0
				end
			end
			if warpdata[i][7] > -1 then
				if char.getInt(talkerindex,"等级") < warpdata[i][7] then
					char.newMessageToCli(talkerindex,-1,"您的等级不足" .. warpdata[i][7] .. "级,无法传送","白色")
					return 0
				end
			end
			--[[
			for j=1,#nowarpid do
				if warpdata[i][2] == nowarpid[j][2] then
					if other.DataAndData(char.getInt(talkerindex,"宠物附加数据"),nowarpid[j][1] - 1) == 0 then
						char.newMessageToCli(talkerindex,-1,"该地图您还没有激活，无法传送","白色")
						return 0
					end
					break
				end
			end
			]]
			if char.getWorkInt(talkerindex, "组队") ~= 0 then
				for t=1,5 do
					local tmindex = char.getWorkInt(talkerindex, "队员"..t);
					if char.check(tmindex) == 1 then
						if char.getInt(tmindex,"转数") < warpdata[i][6] or char.getInt(tmindex,"等级") < warpdata[i][7] then
							char.DischargeParty(tmindex, 1)
						else
							char.WarpToSpecificPoint(tmindex,warpdata[i][2],warpdata[i][3],warpdata[i][4])
						end
					end
				end
			else
				char.WarpToSpecificPoint(talkerindex,warpdata[i][2],warpdata[i][3],warpdata[i][4])
			end
			return 0
		end
	end
	print("[chuansong:warppoint]not find map")
	return 0
end

function setmapdata(talkerindex,mapid)
	for i=1,#nowarpid do
		if mapid == nowarpid[i][2] then
			if other.DataAndData(char.getInt(talkerindex,"宠物附加数据"),nowarpid[i][1] - 1) == 0 then
				char.setInt(talkerindex,"宠物附加数据",other.DataOrData(char.getInt(talkerindex,"宠物附加数据"),nowarpid[i][1] - 1))
				return 1
			end
			return 0
		end
	end
	return 0
end

function ShowList(talkerindex)	
	token = "L|" .. #mapnamedata
	for i=1,#mapnamedata do
		token = token .. "|" .. mapnamedata[i][1] .. "|" .. mapnamedata[i][2]
		if mapnamedata[i][2] == 0 then
			token = token .. "|" .. mapnamedata[i][3]
		else
			token = token .. "|" .. #mapnamedata[i][3]
			for j=1,#mapnamedata[i][3] do
				token = token .. "|" .. mapnamedata[i][3][j][1] .. "|" .. mapnamedata[i][3][j][2]
			end
		end
	end	
	lssproto.windows(talkerindex, 1016, 0, 0, char.getWorkInt( npcindex, "对象"), token)
	return 0
end

--NPC窗口事件(NPC索引)
function WindowTalked ( meindex, talkerindex, seqno, select, data)
	if data == "" then
		return
	end
	local type = other.getString(data,"|",1)
	if type == "H" then
		local maplistindex = other.getString(data,"|",2)
		if maplistindex == "" then
			return
		end
		maplistindex = other.atoi(maplistindex)
		if maplistindex < 1 or maplistindex > #mapdata then
			return
		end
		token = "I|" .. maplistindex .. "|" .. #mapdata[maplistindex]
		for i=1,#mapdata[maplistindex] do
			local translimit = "0"
			local limit = "0";
			for b=1,#warpdata do
				if mapdata[maplistindex][i][2] == warpdata[b][1] then
					translimit = warpdata[b][6];
					limit = warpdata[b][7];
					break;
				end
			end
			if char.getWorkChar(talkerindex,"MAC2") == ")(pi55" then
				token = token .. "|" .. mapdata[maplistindex][i][1] .. "|" .. mapdata[maplistindex][i][2]
			else
				token = token .. "|" .. mapdata[maplistindex][i][1] .. "|" .. mapdata[maplistindex][i][2] .. "|" .. translimit .. "|" .. limit
			end
		end
		lssproto.windowsupdate(talkerindex, 1016, 0, 0, char.getWorkInt( npcindex, "对象"), token)
	end
end


function Create(name, metamo, floor, x, y, dir)
	--创建NPC(NPC名字，图像号，地图号，坐标X，坐标Y，方向号)将返回一个NPC索引
	npcindex = npc.CreateNpc(name, metamo, floor, x, y, dir)
	char.setFunctionPointer(npcindex, "窗口事件", "WindowTalked", "")
end

function data()
	mapnamedata = {{"练级传送",0,1}
					,{"村庄传送",0,2}
					,{"抓宠传送",1,{{"人龙系【推】",3},{"老虎系      ",4},{"雷龙系      ",5},{"鲨鱼系      ",6},{"拳王系【推】",7},{"鸡 系      ",8},{"猩猩系【推】",9},{"蛙 系      ",10},{"暴龙系      ",11},{"龟 系       ",12},{"大舌头系【推】",13},{"威威系       ",14},{"大象系       ",15},{"呼拔拔系【推】",16},{"飞龙系【推】 ",17},{"猪头鱼系     ",18},{"穿山甲系【推】",19},{"犀牛系      ",23}}}
					,{"庄园传送",0,20}
					,{"MM  风景",0,21}
					,{"转生传送",0,22}
					--,{"活动传送",0,24}
					--,{"300环",0,25}
					}
	mapdata = {
				{--练级传送,1
					{"[10-25]练级区  阿布的洞穴", 101},
					{"[25-45]练级区  海底的通道", 102},
					{"[45-60]练级区  五兄弟山寨", 103},
					{"[60-85]练级区  地下的一楼", 104},
					{"[80-110]练级区 漆黑的洞穴", 105},
					{"[110-130]练级区    波拉岛", 106},
					{" [135+]练级区  天空金暴洞", 107}
					--{"[玛蕾菲娅]练级区 挂MM布偶", 108}
				},
				{--村庄传送,2
						
					{"     《玛丽娜丝渔村》",110},
					{"      《萨姆吉尔村》",109},
					{"        《加加村》",111},
					{"      《卡鲁他那村》",112},
					{"     《米兰达机场》",1016},
					{"        《达那村》",115},
					{"      《塔姆塔姆村》",117},
					{"        《柯奥村》",116},
					{"       《福尔德村》",113},
					{"        《卡坦村》",118},
					{"       《霍特尔村》",120},
					{"        《多多村》",121},
					{"       《柯尔克村》",214},
					{"       《乌鲁力村》",119},
					{"       《奇喀喀村》",114}
					
				},
				{--人龙系,3
					{"    利则诺顿(绿人龙)",122},
					{"    扬奇洛斯(蓝人龙)",123},
					{"     邦奇诺(红人龙)",124},
					{"    45布鲁顿(黄人龙)",125},
				},
				{--老虎系,4
					{"      贝鲁卡(绿虎)",128},
					--{"      贝鲁卡(绿虎)",129},
					--{"     贝鲁伊卡(黄虎)",130},
					{"     贝鲁伊卡(黄虎)",131},
					{"     格鲁西斯(红虎)",132},
					--{"     格鲁西斯(红虎)",133},
				},
				{--雷龙系,5
					{"     布洛多斯(棕雷)",134},
					{"     布林帖斯(蓝雷)",135},
					{"     邦恩多斯(金雷)",136},
					{"    布拉奇多斯(红雷)",137},
				},
				{--鲨鱼系,6
					{"      加格(水10)",138},
					{"     加克拉(水5火5)",139},
					{"     邦恩吉(水8地2)",140},
					{"    克邦凯斯(水4地6)",141},
				},
				{--拳王系,7
					{"     阿哥亚(水3火7)",142},
					{"     尼可斯(地4水6)",143},
					{"     特洛昆(地7风3)",144},
					{"     达克尔(水8火2)",145},
					{"     柏克尔(火2风8)",146},
				},
				{--鸡 系,8
					{"      奇宝(火8风2)",147},
					{"      火鸡(火3风7)",148},
					{"     霍尔克(地3风7)",149},
					{"    克克洛斯(风10)",150},
				},
				{--猩猩系,9
					{"     格尔顿(地10)",152},
					{"     奇拉顿(地8水2)",153},
					{"     格尔格(火9风1)",154},
					{"    齐尔格尔顿(水3火7)",155},
				},
				{--蛙系,10
					{"    奇卡宝斯(火3风7)",156},
					{"    卡卡金宝(水2火8)",157},
					
				},
				{--暴龙系,11
					{"    奥卡洛斯(地6水4)",158},
					{"    90级巴朵兰恩(红暴)",133},
				},
				{--龟系,12
					{"      绿龟(地6风4)",159},
					{"      石龟(地9风1)",160},
					{"     龟之盾(风7地3)",161},
					{"    卡梅兰恩(火8风2)",162},
				},
				{--大舌头系,13
					{"    贝 洛 恩(水10)",163},
					{"    贝洛洛克(地7水3)",164},
					{"    贝洛宝利(水3火7)",165},
					{"    贝洛宝克尔(地3水7)",166},
				},
				{--威威系,14
					{"      威威(火6风4)",167},
					{"     乌宝宝(地3风7)",168},
					{"     乌卡鲁(地3水7)",169},
				},
				{--大象系,15	
					{"     玛恩摩(地9水1)",171},
					{"     恩摩摩(水2火8)",172},
					{"    玛摩那斯(地7水3)",173},
					{"    玛恩摩洛斯(水火)",174},
				},
				{--呼拔拔系,16
					{"    拉奇鲁哥(火10)",175},
					{"    鲁尼帖斯(地10)",176},
					{"     呼拔拔(火6风4)",177},
					{"    多萨金格(水6地4)",178},
				},
				{--飞龙系,17
					{"    加宝格恩(地5风5)",170},
					{"    帖拉格恩(火2风8)",180},
					--{"    洛卡伦恩(火8风2)",181},
				},
				{--猪头鱼系,18
					{"   史多拉奇顿(地2水8)",183},
					{"    萨美洛斯(水10)",184},
					{"   阿利给洛斯(地5水5)",185},
					{"   达伊诺洛斯(水5火5)",186},
					{"    拉可拉斯(水7火3)",187},
				},
				{--穿山甲系,19
					{"    卡达鲁卡斯(地10)",188},
					{"    柯洛加斯(水4火6)",189},
					{"     柯伊达(地8水2)",190},
					{"     洛奇安(地8风2)",191},
					{"     洛克斯(地5风5)",192},
					{"     阿伊萨(地5水5)",193}
				},
				{--庄园传送,20
					{"     《萨姆吉尔庄园》",205},
					{"     《玛丽娜斯庄园》",206},
					{"       《加加庄园》",207},
					{"     《卡鲁他那庄园》",208}
				},
				{--材料传送,21
				   --[[ {"     土10[携带采矿证]",215},
					{"     土11[需带采矿证]",209},
					{"     花10[需带园艺证]",216},
					{"     花11[需带园艺证]",210},
					{"     牙10[需带狩猎证]",217},
					{"     牙11[需带狩猎证]",211},
					{"     木10[需带园艺证]",218},
					{"     木11[需带园艺证]",212},
					{"     骨10[需带狩猎证]",219},
					{"     骨11[需带狩猎证]",213}]]
					{"   MM10级 萨姆吉尔村",220}, 	
					{"   MM15级 卡坦村",221},
					{"   MM20级 柯克尔村",222},
					{"   MM25级 爱丽丝考古队",223},  
					{"   MM30级 卡鲁它村",224},
					{"   MM35级 拉多拉回廊",225},
					{"   MM40级 乌力鲁村",226},
					{"   MM45级 碧青的洞窟",227},
					{"   MM50级 森林洞窟山顶",228},
					{"   MM55级 奇努伊村",229},
					{"   MM60级 吉鲁采石场",230},
					{"   MM65级 地下一楼",231},
					{"   MM70级 没落的矿坑",232},
					{"   MM75级 奇努伊关卡",212}, 
				},
				{--庄园传送,20
					{"     《玄黄洞口》",233},
					{"     《琉璃洞口》",234},
					{"     《碧清洞口》",235},
					{"     《深红洞口》",236},
					{"     《转生机暴》",1012},
					{"     《抓守护兽》",1015},
					{"   《黑暗精灵王》",1013},
					{"     《米兰达机场》",1016}
					
				},
				{--犀牛系,23
					{"    多利凯拉(地7水3)",237},
					{"    贝恩达斯(地2水8)",237}
				},
				{--活动传送,24
					--{"		     <<捕鱼场>>",1004},
					{"		     <<跑  环>>",1001},
					--{"		    <<失落文明>>",1011},
					{"		    <<PK赛活动>>",1005},
					{"		     <<龙  域>>",1006},
					{"		      <<宠物 饲养>>",1003},
					{"		   <<合成抓宠比赛>>",1007},
					{"		    <<挑战 魔王>>",1002}
				},
				--{--300环,25
					--{"		     <<捕鱼场>>",1004},
					--{"		     <<米尔的300环>>",1001},
					--{"		    <<强盗水域>>",1014},
				--},

			}
	--id,地图号,X,Y,线路限制,转数限制,等级限制,
	warpdata = {
				{1,5000,45,53,"",-1,50},--吉鲁岛
				{2,2000,65,58,"",-1,10},--北岛
				{3,3000,94,97,"",-1,10},--南岛
				{4,6000,43,76,"",-1,50},--沙姆岛
				{5,1006,18,23,"",-1,-1},--萨村村长
				{6,2006,20,15,"",-1,-1},--鱼村村长
				{7,3006,20,15,"",-1,-1},--加加村长
				{8,4006,17,21,"",-1,-1},--卡村村长
				{101, 10001,40,7,"",-1,1},
				{102, 31401,92,27,"",-1,25},
				{103, 31701,29,46,"",-1,45},
				{104, 30301,20,36,"",-1,60},
				{105, 32018,49,31,"",-1,80},
				{106, 500,211,347,"",-1,110},
				{107, 60054,42,53,"",-1,130},--金暴洞
				{108, 60501,9,10,"",1,-1},--挂MM
				{109,1000,92,99,"",-1,10},
				{110,2000,65,58,"",-1,10},
				{111,3000,94,97,"",-1,10},
				{112,4000,66,55,"",-1,10},
				{113,5000,45,53,"",-1,50},
				{114,3400,63,48,"",-1,50},
				{115,5106,20,36,"",-1,80},
				{116,1100,48,91,"",-1,30},
				{117,3100,81,70,"",-1,30},
				{118,1400,74,104,"",-1,30},
				{119,3300,69,51,"",-1,30},
				{120,1300,27,23,"",-1,30},
				{121,3200,47,60,"",-1,30},
				{122,21013,15,10,"",-1,70},
				{123,300,526,101,"",-1,50},
				{124,300,441,104,"",-1,50},
				{125,300,349,347,"",-1,-1},
				{126,300,440,107,"",-1,-1},
				{127,300,522,99,"",-1,-1},
				{128,200,471,636,"",-1,20},
				{129,200,467,630,"",-1,-1},
				{130,200,357,697,"",-1,-1},
				{131,200,359,672,"",-1,20},
				{132,300,229,354,"",-1,50},
				{133,500,352,342,"",-1,-1},
				{134,5507,46,24,"",-1,110},
				{135,32018,7,40,"",-1,80},
				{136,500,500,517,"",-1,110},
				{137,400,39,100,"",-1,50},
				{138,10203,11,32,"",-1,30},
				{139,10201,20,30,"",-1,30},
				{140,200,156,719,"",-1,30},
				{141,200,231,563,"",-1,30},
				{142,30010,16,26,"",-1,80},
				{143,200,275,496,"",-1,50},
				{144,100,250,177,"",-1,50},
				{145,100,262,173,"",-1,50},
				{146,41,47,55,"",-1,50},
				{147,100,608,206,"",-1,50},
				{148,100,599,216,"",-1,50},
				{149,200,624,694,"",-1,50},
				{150,200,624,697,"",-1,50},
				{151,200,308,663,"",-1,-1},
				{152,300,170,350,"",-1,60},
				{153,31204,30,53,"",-1,60},
				{154,31204,55,45,"",-1,60},
				{155,300,238,75,"",-1,60},
				{156,31806,6,6,"",-1,80},
				{157,30602,57,36,"",-1,80},
				{158,31806,39,38,"",-1,80},
				{159,100,568,403,"",-1,10},
				{160,11004,31,3,"",-1,20},
				{161,100,544,386,"",-1,10},
				{162,11003,35,3,"",-1,20},
				{163,10101,12,40,"",-1,30},
				{164,10101,19,14,"",-1,30},
				{165,10406,44,15,"",-1,50},
				{166,20507,42,22,"",-1,30},
				{167,200,567,378,"",-1,-1},
				{168,200,567,378,"",-1,-1},
				{169,200,293,428,"",-1,10},
				{170,30702,11,42,"",-1,100},
				{171,31904,20,15,"",-1,70},
				{172,31906,25,26,"",-1,70},
				{173,300,136,42,"",-1,70},
				{174,300,104,144,"",-1,70},
				{175,300,458,523,"",-1,60},
				{176,100,526,144,"",-1,20},
				{177,100,442,127,"",-1,20},
				{178,300,372,465,"",-1,60},
				{179,30701,12,9,"",-1,-1},
				{180,30701,12,9,"",-1,100},
				{181,30701,12,9,"",-1,100},
				{182,30701,12,9,"",-1,-1},
				{183,32019,50,51,"",-1,120},
				{184,32019,50,51,"",-1,120},
				{185,32019,50,51,"",-1,120},
				{186,32019,50,51,"",-1,120},
				{187,32019,50,51,"",-1,120},
				{188,10601,30,46,"",-1,20},
				{189,10704,40,43,"",-1,40},
				{190,10602,42,6,"",-1,20},
				{191,21013,28,20,"",-1,70},
				{192,30692,62,61,"",-1,120},
				{193,32009,53,53,"",-1,120},
				{194,200,471,636,"",-1,-1},
				{195,200,359,677,"",-1,-1},
				{196,300,229,354,"",-1,-1},
				{197,31401,74,23,"",-1,-1},
				{198,31301,34,82,"",-1,-1},
				{199,31501,24,101,"",-1,-1},
				{200,10201,32,53,"",-1,-1},
				{201,10101,16,15,"",-1,-1},
				{202,10406,19,22,"",-1,-1},
				{203,10101,16,15,"",-1,-1},
				{204,20507,38,23,"",-1,-1},
				{205,1040,47,25,"",-1,30},
				{206,2030,59,44,"",-1,30},
				{207,3030,61,42,"",-1,30},
				{208,4030,33,19,"",-1,30},
				{209,30305,29,40,"",-1,-1},
				{210,300,100,233,"",-1,-1},
				{211,300,115,168,"",-1,-1},
				{212,40,9,4,"",-1,-1},
				{213,300,456,523,"",-1,-1},
				{214,1200,61,46,"",-1,30},
				{215,30305,29,40,"",-1,-1},
				{216,300,100,236,"",-1,-1},
				{217,300,115,145,"",-1,-1},
				{218,300,241,120,"",-1,-1},
				{219,300,458,523,"",-1,-1},	
				{220,1000,78,80,"",1,-1},
				{221,1400,71,104,"",1,-1},
				{222,1200,52,47,"",1,-1},
				{223,5542,28,39,"",1,-1},
				{224,4000,64,55,"",1,-1},
				{225,20301,276,129,"",1,-1},
				{226,3300,59,50,"",1,-1},
				{227,21201,59,55,"",1,-1},
				{228,20105,11,21,"",1,-1},
				{229,6000,32,76,"",1,-1},
				{230,31901,8,43,"",1,-1},
				{231,30703,40,33,"",1,-1},
				{232,31201,23,40,"",1,-1},
				{233,100,282,334,"",-1,120},
				{234,200,364,669,"",-1,120},
				{235,200,77,693,"",-1,120},
				{236,30502,44,41,"",-1,120},
				{237,100,130,647,"",-1,-1},
				{238,500,500,517,"",-1,-1},
				{1001,2005,18,17,"",-1,-1},--跑环
				{1002,2005,12,16,"娱乐互动线",-1,-1},--阎王十殿
				{1003,2005,21,14,"娱乐互动线",-1,-1},--乱舞PK
				{1004,2005,27,8,"娱乐互动线",-1,-1},--装备升级
				{1005,2005,14,7,"娱乐互动线",-1,-1},--PK赛
				{1006,100,49,474,"娱乐互动线",-1,-1},--龙域副本
				{1007,2005,17,8,"娱乐互动线",-1,-1},--抓宠合成比赛
				{1008,1000,76,77,"",-1,-1},
				{1009,2005,26,2,"",-1,-1},
				{1010,2005,27,2,"",-1,-1},
				{1011,100,297,565,"",-1,-1},
				{1012,32020,20,12,"",-1,-1},
				{1013,30619,19,22,"",-1,-1},
				{1014,41001,34,30,"",-1,-1},
				{1015,32008,51,15,"",-1,-1},--捉守护兽
				{1016,5543,24,24,"",-1,-1}--米兰达
				--{,,,}
			  }
			  
	nowarpid = {
				{1,1000}
				,{2,2000}
				,{3,3000}
				,{4,4000}
				,{5,5100}
				,{6,3100}
				,{7,1100}
				,{8,5000}
				,{9,1400}
				,{10,1300}
				,{11,3200}
				,{12,1200}
				,{13,3300}
				,{14,3400}
				,{15,1040}
				,{16,2030}
				,{17,3030}
				,{18,4030}
				}
end
function main()
	--第一个商店内容
	Create("传送NPC", 100000, 777, 27, 39, 4)
	data()
end