function queryFlg(talkerindex)
	local ret = sasql.query("select `flg1`,`flg2` from `baodian` where `cdkey`='" .. char.getChar(talkerindex,"账号") .. "'")
	if ret == 1 then
		sasql.free_result()
		sasql.store_result()
		if sasql.num_rows() > 0 then
			sasql.fetch_row()
			return other.atoi(sasql.data(1)),other.atoi(sasql.data(2))
		else
			return 0,0
		end
	else
		return 0xffffffff,0xffffffff
	end
end

function updateFlg(talkerindex,flg1,flg2)
	sasql.query("replace into `baodian` values('" .. char.getChar(talkerindex,"账号") .. "', " .. flg1 .. "," .. flg2 .. ")")
end

function ShowHead(talkerindex)
	token = "L|" .. #listdata
	for i=1,#listdata do
		token = token .. "|" .. listdata[i][1] .. "|" .. #listdata[i] - 1
		for j=2,#listdata[i] do
			token = token .. "|" .. listdata[i][j][1] .. "|" .. listdata[i][j][2]
		end
	end
	lssproto.windows(talkerindex, 1031, 8, 0, char.getWorkInt( npcindex, "对象"), token)
	return 0
end

--NPC窗口事件(NPC索引)
function WindowTalked ( meindex, talkerindex, seqno, select, data)
--	char.TalkToCli(talkerindex, -1, "Seqno:"..seqno.." | select:"..select.." | data:"..data, "随机色")
	if data == "" then
		return
	end
	local type = other.getString(data,"|",1)
	if type == "S" then
		local listindex = other.getString(data,"|",2)
		if listindex == "" then
			return
		end
		listindex = other.atoi(listindex)
		local flg1,flg2 = queryFlg(talkerindex)
		for i=1,#listdata do
			for j=2,#listdata[i] do
				if listindex == listdata[i][j][2] then
					token = "I|" .. #listdata[i][j][3]
					for k=1,#listdata[i][j][3] do
						local myflg = 0
						if listdata[i][j][3][k][1] <= 32 then
							myflg = other.DataAndData(flg1,listdata[i][j][3][k][1] - 1)
						else
							myflg = other.DataAndData(flg2,listdata[i][j][3][k][1] - 32 - 1)
						end
						token = token .. "|" .. listdata[i][j][3][k][2] .. "|" .. listdata[i][j][3][k][3] .. "|" .. listdata[i][j][3][k][4] .. "|" .. listdata[i][j][3][k][5] .. "|" .. listdata[i][j][3][k][1] .. "|" .. myflg
					end
					lssproto.windowsupdate(talkerindex, 1031, 8, 0, char.getWorkInt( meindex, "对象"), token)
					return
				end
			end
		end
	elseif type == "G" then
		local listindex = other.getString(data,"|",2)
		if listindex == "" then
			return
		end
		listindex = other.atoi(listindex)
		local flg1,flg2 = queryFlg(talkerindex)
		for i=1,#listdata do
			for j=2,#listdata[i] do
				for k=1,#listdata[i][j][3] do
					if listindex == listdata[i][j][3][k][1] then
						local myflg = 0
						if listdata[i][j][3][k][1] <= 32 then
							myflg = other.DataAndData(flg1,listdata[i][j][3][k][1] - 1)
						else
							myflg = other.DataAndData(flg2,listdata[i][j][3][k][1] - 32 - 1)
						end
						if myflg == 0 then
							if listdata[i][j][3][k][4] == 1 then
								local myvippoint = sasql.getVipPoint(talkerindex)
								sasql.setVipPoint(talkerindex,myvippoint + listdata[i][j][3][k][5])
								char.newMessageToCli(talkerindex,-1,"获得" .. listdata[i][j][3][k][5] .. "金币","白色")
								token = "insert into `VipPointLog` values ('" .. char.getChar(talkerindex,"账号") .. "'," .. listdata[i][j][3][k][5] .. "," .. myvippoint .. "," .. myvippoint + listdata[i][j][3][k][5] .. ",'宝典奖励增加" .. listdata[i][j][3][k][5] .. "金币',NOW())"
								sasql.query(token)
							elseif listdata[i][j][3][k][4] == 2 then
								sasql.setPetPoint(talkerindex,sasql.getPetPoint(talkerindex) + listdata[i][j][3][k][5])
								char.newMessageToCli(talkerindex,-1,"获得" .. listdata[i][j][3][k][5] .. "水晶","白色")
							elseif listdata[i][j][3][k][4] == 3 then
								char.setInt(talkerindex,"石币",char.getInt(talkerindex,"石币") + listdata[i][j][3][k][5])
								char.newMessageToCli(talkerindex,-1,"获得" .. listdata[i][j][3][k][5] .. "石币","白色")
							elseif listdata[i][j][3][k][4] == 4 then
								char.setInt(talkerindex,"经验",char.getInt(talkerindex,"经验") + listdata[i][j][3][k][5])
								char.newMessageToCli(talkerindex,-1,"获得" .. listdata[i][j][3][k][5] .. "经验","白色")
							end
							if listdata[i][j][3][k][1] <= 32 then
								flg1 = other.DataOrData(flg1,listdata[i][j][3][k][1] - 1)
							else
								flg2 = other.DataOrData(flg2,listdata[i][j][3][k][1] - 32 - 1)
							end
							updateFlg(talkerindex,flg1,flg2)
						else
							char.newMessageToCli(talkerindex,-1,"您已经领取过奖励了","白色")
						end
						return
					end
				end
			end
		end
	end
end


function Create(name, metamo, floor, x, y, dir)
	--创建NPC(NPC名字，图像号，地图号，坐标X，坐标Y，方向号)将返回一个NPC索引
	npcindex = npc.CreateNpc(name, metamo, floor, x, y, dir)
	--设置事件触发(NPC索引，事件，执行函数，执行函数文件路径)

	char.setFunctionPointer(npcindex, "窗口事件", "WindowTalked", "")
end


function data()
	listdata = 
			{
				{
					"战斗",
					{
						"基础规则",1,
						{
							{1,"出战配备","人物可骑宠最多让一只战宠出战",3,1000},
							{2,"携带宠物出战","携带宠物出战时，宠物可以使用技能，但宠物无法使用道具和逃跑命令",3,1000},
                            {3,"行动顺序","速度值决定了人物和战宠行动的先后顺序",3,1000},							
							{4,"属性克制","地克水，水克火，火克风，风克地；而无属性给任何的10点属性全克",3,1000}
							--{3,"","",3,1000},
						}
					},
					{
						"基础战斗",2,
						{
							{5,"宠物变更","进入战斗前需将宠物设置为待命，进入战斗可更换召出或收回宠物",3,1000},
							{6,"防御","宠物或人物需要降低受到的伤害时，使用防御降低受到的伤害",3,1000},
							{7,"逃跑","玩家不想战斗或者不敌对方时，可以使用逃跑（有概率失败）来躲避战斗",3,1000},
							{8,"自动战斗","游戏界面-更多选项-战斗设置，设置自动战斗",3,1000}
						}
					},
					{
						"合击技巧",3,
						{
							{9,"合击","前后行动的两个进展普攻单位，攻击的目标相同时，有可能触发合击",3,1000},
							{10,"合击效果","参与合击的单位越多，总伤害加成越高，合击不会被闪避，忠犬和反击",3,1000}
						}
					},
					{
						"进阶战术",4,
						{
							{11,"战前准备","人物和宠物属性的影响非常重要，在战斗找到合适的配置，可获得巨大优势",3,1000},
							{12,"单属性","单属性有时会有优势，比如水属性的，地属性就能实现完美克制",3,1000},
							{13,"伤害控制","根据出手的先后顺序调整攻击安排，玩家可以更好的保护自己的角色",3,1000}
						}
					}
				},
				{
					"装备",
					{
						"装备获取",5,
						{
							{14,"基础装备","可前往至4大村庄武器店 福村道具店 竞技场商店均有购买",3,1000},
							{15,"装备来源","完成各类任务会赠送相应装备，一些特殊活动会提供强力装备",3,1000}
						}
					},
					{
						"装备合成",6,
						{
							{16,"合成装备","合成装备比商店装备属性更强更好，建议使用宠物修宝学习加工技能合成",3,1000},
							{17,"素材获取","玩家可在4大村庄购买低级素材，高级素材可传送至高阶地点获取",3,1000},
							{18,"稀有装备","玩家后期可通过挑战十殿阎王，欢乐派派送，天龙部队和高阶任务获取",3,1000}
						}
					},
					{
						"装备精灵",7,
						{
							{19,"治愈的精灵","恢复自己一定生命值，随着精灵等级提高恢复量提高",3,1000},
							{20,"滋润的精灵","恢复单体一定生命值，随着精灵等级提高恢复量提高",3,1000},
							{21,"恩惠的精灵","恢复全体一定生命值，随着精灵等级提高恢复量提高",3,1000},
							{22,"复活的精灵","令单体复活并恢复一定生命值，随着精灵等级提高恢复量提高",3,1000},
							{23,"净化精灵－睡眠","LV1恢复单体睡眠状态，LV2恢复我方全体睡眠状态",3,1000},
							{24,"净化精灵－酒醉","LV1恢复单体酒醉状态，LV2恢复我方全体酒醉状态",3,1000},
							{25,"净化精灵－中毒","LV1恢复单体中毒状态，LV2恢复我方全体中毒状态",3,1000},
							{26,"净化精灵－石化","LV1恢复单体睡眠状态，LV2恢复我方全体石化状态",3,1000},
							{27,"净化精灵－混乱","LV1恢复单体睡眠状态，LV2恢复我方全体混乱状态",3,1000},
							{28,"高等净化精灵","LV1恢复单体所有异常状态,LV2恢复我方全体所有异常状态",3,1000},
							{29,"大地的精灵","提高地属性能力N回合，增加地属性伤害",3,1000},
							{30,"水的精灵","提高水属性能力N回合，增加水属性伤害",3,1000},
							{31,"火炎的精灵","提高火属性能力N回合，增加火属性伤害",3,1000},
							{32,"疾风的精灵","提高风属性能力N回合，增加风属性伤害",3,1000},
							{33,"调和的精灵","将当前战场上的属性精灵抹去",3,1000},
							{34,"彩虹的精灵","令单体属性反转，比如地属性变成火属性，水属性变成风属性",3,1000},
							{35,"奥萝拉的精灵","令全体属性反转，比如地属性变成火属性，水属性变成风属性",3,1000},
							{36,"镜的精灵","反射攻击一次，随精灵等级提高会增加耗气量",3,1000},
							{37,"光的精灵","吸收攻击一次，随精灵等级提高会增加耗气量",3,1000},
							{38,"守护的精灵","使对方攻击无效两次",3,1000}
						}
					},
					{
						"装备种类",8,
						{
							{39,"防具","增加防御，可附带净化精灵和属性",3,1000},
							{40,"兜","增加大量防御扣除少许速度，可附带净化精灵和属性",3,1000},
							{41,"铠","增加大量防御扣除少许速度，可附带治愈，滋润，恩惠精灵和属性",3,1000},
							{42,"服","增加防御，可附带治愈，滋润，恩惠精灵和属性",3,1000},
							{43,"手环","增加少许攻击，防御，魅力，扣除少许速度",3,1000},
							{44,"乐器","增加魅力，可附带增加属性伤害精灵",3,1000},
							{45,"戒指","增加魅力，可附带会心一击上升率",3,1000},
							{46,"首饰","增加魅力，相应抗性和减少相应抗性",3,1000},
							{47,"耳环","增加魅力，可附带回避率上升",3,1000},
							{48,"护身符","增加魅力，可附带复活精灵",3,1000}
						}
					}
				},
				{
					"武器应用",
					{
						"武器",9,
						{
							{49,"枪","攻击较高，可对单1敌方造成1次伤害，缺点：装备属性扣除少许速度",3,1000},
							{50,"斧","攻击高，可对单1敌方造成1次伤害，缺点：装备属性扣除少许敏捷和防御",3,1000},
							{51,"石","攻击低，可对单1敌方造成远程1次伤害，缺点：装备属性扣除少许防御",3,1000},
							{52,"爪","攻击低，可对单1敌方造成多段伤害",3,1000},
							{53,"弓","攻击低，可对N个敌方造成1次伤害，缺点：装备属性扣除少许防御",3,1000},
							{54,"棒","攻击一般，可对单1敌方造成1次伤害",3,1000},
							{55,"回旋镖","攻击低，可对横排敌方造成1次伤害",3,1000},
							{56,"投掷斧头","攻击一般，可对单1敌方造成远程1次伤害",3,1000}
						}
					},
					{
						"武器精灵",10,
						{
							{57,"猛毒的精灵","单1敌方，命中单位造成N回合毒状态，按总血量扣除当前血量",3,1000},
							{58,"毒雾的精灵","全体敌方，命中单位造成N回合毒状态，按总血量扣除当前血量",3,1000},
							{59,"混乱的精灵","单1敌方，命中单位造成N回合的混乱状态，敌我不分",3,1000},
							{60,"混迷的精灵","全体敌方，命中单位造成N回合的混乱状态，敌我不分",3,1000},
							{61,"睡眠的精灵","单1敌方，命中单位造成N回合的睡眠状态，无法行动，攻击会醒来",3,1000},
							{62,"昏睡的精灵","全体敌方，命中单位造成N回合的睡眠状态，无法行动，攻击会醒来",3,1000},
							{63,"硬化的精灵","单1敌方，命中单位造成N回合的石化状态，无法行动",3,1000},
							{64,"石化的精灵","全体敌方，命中单位造成N回合的石化状态，无法行动",3,1000},
							{65,"酒的精灵","单1敌方，命中单位造成N回合的酒醉状态，减少单位命中",3,1000},
							{66,"酩酊的精灵","全体敌方：命中单位造成N回合的酒醉状态，减少单位命中",3,1000}
						}
					},
					{
						"武器属性",11,
						{
							{67,"武器附带属性","可以改变人物的属性（地水火风）",3,1000},
							{68,"无效果属性","携带同属性武器无变化（地水火风）",3,1000}
						}
					}
				},
				{
					"宠物",
					{
						"基础介绍",12,
						{			
							{69,"品种","宠物有属性之分，熟练掌握每只宠物的属性克制关系，能大幅提升战斗效率",3,1000},
							{70,"宠物成长","宠物中也有强弱之分，通常初始4围属性较高的获得高成长的概率越大",3,1000},
							{71,"宠物定位","宠物一般可以分为高攻,高防,高速,均衡大致4类,优先培养一只高攻的宠物吧",3,1000}
						}
					},
					{
						"宠物抓捕",13,
						{
							{72,"魅力","魅力高低影响捕捉宠物成功率",3,1000},
							{73,"等级","等级高低影响捕捉宠物成功率",3,1000},
							{74,"血量","宠物血量越低抓捕几率越高",3,1000},
							{75,"查看宠物","玩家可在排行榜内查看相应宠物的4围和成长",3,1000}
						}
					},
					{
						"宠物技能",14,
						{
					        {76,"待机，攻击，防御","待机，什么也不做、攻击，通常攻击、防御，通常防御",3,1000},
							{77,"破除防御","破除采取防御的敌人，对防御目标造成伤害",3,1000},
							{78,"连续攻击","对单位造成2次连续攻击，如该单位死亡随机攻击其他单位",3,1000},
							{79,"三段攻击","对单位造成3次连续攻击，如该单位死亡随机攻击其他单位",3,1000},
							{80,"背水之战其之1","防御力减30%，攻击力变成+30%",3,1000},
							{81,"背水之战其之2","防御力减50%，攻击力变成+50%",3,1000},
							{82,"猛毒攻击","攻击力减50%五回合前后让敌人中毒",3,1000},
							{83,"石化攻击","攻击力减30%三回合前后让敌人石化",3,1000},
							{84,"混乱攻击","攻击力减30%三回合前后让敌人混乱",3,1000},
							{85,"催眠攻击","攻击力减30%三回合前后让敌人沉睡",3,1000},
							{86,"忠犬","保护主人不受到敌人的直接攻击，无法保护合击对象",3,1000},
							{87,"突击","1回合储存力量，下次攻击时，就会有两倍的攻击力",3,1000},
							{88,"双重突击","2回合储存力量，下次攻击时，就会有两倍以上的攻击力",3,1000},
							{89,"一击必杀","给予两倍的攻击伤害但是命中率下降",3,1000},
							{90,"地球一周","一回合从敌人背后以两倍攻击力攻击单位",3,1000},
							{91,"旅程伙伴","把一只宠物当作是伙伴当场带走，成功：宠物与带走宠物都回到宠物栏，失败：自己回到宠物栏",3,1000},
							{92,"不防守战法","自己不进行攻击，反击跟回避率，就会变的非常高",3,1000},
							{93,"加工","合成素材制作道具",3,1000},
							{94,"料理","使用素材制作料理",3,1000}
						}
					},
					{
						"初期宠",15,
						{
							{95,"人龙系","玩家可以通过贴心传送-人龙系捕捉相应人龙，前期必备",3,1000},
							{96,"其他系","玩家可以通过贴心传送-捕捉其他类宠物",3,1000}
						}
					}
				},
				{
					"指令",
					{
						"游戏指令",16,
						{
							{97,"便捷指令","点击聊天图标=内含表情、指令、道具、任务、宠物、历史、红包、屏蔽功能",3,1000},
							{98,"原地遇敌","/yd",3,1000},
							{99,"退出组队","/tc 可在战斗中使用",3,1000},
							--{100,"叠加指令","/叠加 可自动叠加包裹内可以叠加的物品",3,1000},
							{101,"魅力增加","/魅力 加满当前账号的魅力值，扣除5000石币",3,1000},
							{102,"忠诚增加","/忠诚 1-5 加满当前位置宠物的忠诚度，扣除5000石币",3,1000},
							{103,"查询当前服务器时间","/time 或 /时间 查询当前服务器时间，游戏活动族战等以服务器时间为准",3,1000},
							--{104,"解除命令","/解除皮肤 /解除光环 用于解除皮肤和光环特效",3,1000},
							{105,"查询地图详细信息","/地图",3,1000},
							{106,"跑环便捷指令","/跑环 非战斗状态下可查看当前跑环信息",3,1000},
							{107,"组队交通工具","go 立即出发（长毛象和加美航空）",3,1000}
						}
					}
				},
				{
					"玩法",
					{
						"陪练",17,
						{
							{108,"金牌陪练","初期可以使用金牌陪练迅速提升等级，可召唤2个哦",3,1000},
							{109,"组队","可以通过组队系统，寻找组队加入队伍一起练级",3,1000}
						}
					},
					{
						"日常",19,
						{
							{110,"日常","玩家每天完成日常可以获得声望奖励",3,1000}
						}
					},
					{
						"极品人任务",20,
						{
							{111,"极品人任务","玩家需完成182任务+4大洞窟任务再转生",3,1000},
							{112,"4大任务","需完成成人仪式，80级以上，才能做4大洞窟任务",3,1000},
							{113,"转生任务","完成4大才会显示漆黑洞窟任务，转生必做",3,1000},
							{114,"2.5任务","4圣石、黑娃MM、灵力铠、天空岛任务、红暴任务每转必做",3,1000}
						}
					},
					{
						"特色玩法",21,
						{
							{115,"捕鱼达人","娱乐捕鱼可获得大量石币，推荐10级以上参加",3,1000},
							{116,"阎罗十殿","玩家每天可挑战阎王，获得大量奖励建议1转120以上，组队参加",3,1000},
							{117,"每日跑环","玩家进行10轮的跑环，获得可观的声望，每转的110级可接取任务",3,1000},
							{118,"每日答题","玩家可以通过活动-特色玩法-答题，完成任务有丰厚奖励，全等级皆可参加",3,1000},
							{119,"段位排位赛","和玩家实时匹配对抗排行赛，根据段位可获得相应战点，建议5转140级",3,1000},
							{120,"欢乐派派送","使用象卷进行抽奖，可获得稀有宠和限时皮肤，全等级皆可参加",3,1000},
							{121,"小猪竞猜","玩家每天都可进行有奖竞猜，猜中第一名可获得20点活力奖励",3,1000},
							{122,"拜师系统","玩家可通过拜师系统拜师或收徒，徒弟出师，师傅可获得称号及奖励",3,1000}
						}
					},
					{
						"限时活动",22,
						{
							{123,"乱舞PK","每周五，日晚上8点开启活动，推荐等级每转130以上，0转不可参加",3,1000},
							{124,"龙域副本","每周二、四、六开放大型BOSS副本，2小时开启一次，建议120级以上参加",3,1000},
							{125,"合成比赛","每周1、3、5、7晚上7点参与合成比赛，可获得大量声望",3,1000},
							{126,"抓宠比赛","每周2、4、6、7晚上7点参与抓宠比赛，可获得大量声望",3,1000},
							{127,"激情捕鱼","每周3、6晚上点可参与，可获得大量金币，全等级皆可参加",3,1000}
						}
					}
				}
				
			}
end

function main()
	data()
	Create("石器宝典", 16130, 777, 12, 13, 6)
end